Can't make Face Wall shape.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FaceWallFailedToMake { get; }
  Visual Basic
Public Shared ReadOnly Property FaceWallFailedToMake As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FaceWallFailedToMake {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace